Hmm it's working for me:
```
❯ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "kubeconfig"
      + id                   = (known after apply)
    }

  # module.kubernetes.kubernetes_namespace.mainwebsite will be created
  + resource "kubernetes_namespace" "mainwebsite" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "env" = "prd"
            }
          + generation       = (known after apply)
          + labels           = {
              + "env"  = "prd"
              + "type" = "website"
            }
          + name             = "mainwebsite"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.kubernetes_secret.sa-github-mainwebsite-deployer will be created
  + resource "kubernetes_secret" "sa-github-mainwebsite-deployer" {
      + id   = (known after apply)
      + type = "kubernetes.io/service-account-token"

      + metadata {
          + annotations      = {
              + "kubernetes.io/service-account.name" = "github-mainwebsite-deployer"
            }
          + generation       = (known after apply)
          + name             = "sa-github-mainwebsite-deployer"
          + namespace        = "mainwebsite"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.kubernetes.kubernetes_service_account.github-mainwebsite-deployer will be created
  + resource "kubernetes_service_account" "github-mainwebsite-deployer" {
      + default_secret_name = (known after apply)
      + id                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-mainwebsite-deployer"
          + namespace        = "mainwebsite"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.scaleway.scaleway_k8s_cluster_beta.ironpeakbe-main-cluster will be created
  + resource "scaleway_k8s_cluster_beta" "ironpeakbe-main-cluster" {
      + apiserver_url    = (known after apply)
      + cni              = "calico"
      + created_at       = (known after apply)
      + enable_dashboard = true
      + id               = (known after apply)
      + ingress          = "traefik"
      + kubeconfig       = (known after apply)
      + name             = "ironpeakbe-main-cluster"
      + organization_id  = (known after apply)
      + region           = (known after apply)
      + status           = (known after apply)
      + tags             = [
          + "k8s",
          + "ironpeakbe",
          + "main-cluster",
          + "prd",
        ]
      + updated_at       = (known after apply)
      + version          = "1.17.2"
      + wildcard_dns     = (known after apply)

      + autoscaler_config {
          + balance_similar_node_groups     = (known after apply)
          + disable_scale_down              = (known after apply)
          + estimator                       = (known after apply)
          + expander                        = (known after apply)
          + expendable_pods_priority_cutoff = (known after apply)
          + ignore_daemonsets_utilization   = (known after apply)
          + scale_down_delay_after_add      = (known after apply)
        }

      + default_pool {
          + autohealing       = true
          + autoscaling       = true
          + container_runtime = "containerd"
          + created_at        = (known after apply)
          + max_size          = 1
          + min_size          = 1
          + node_type         = "GP1-XS"
          + pool_id           = (known after apply)
          + size              = 1
          + status            = (known after apply)
          + updated_at        = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

Are you sure your state is empty?